nce2-4/L88.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-02 Mon 09:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org349b654" class="outline-2">
<h2 id="org349b654">Lesson 88 Trapped in a mine</h2>
<div class="outline-text-2" id="text-org349b654">
<p class="verse">
Why is the rescue taking so long?<br />
<br />
Six men have been trapped in a mine for seventeen hours.<br />
If they are not brought to the surface soon<br />
&#xa0;they may lose their lives.<br />
However, rescue operations are proving difficult.<br />
If explosives are used,<br />
&#xa0;vibrations will cause the roof of the mine to collapse.<br />
Rescue workers are therefore drilling a hole on the north side of the mine.<br />
They intend to bring the men up in a special capsule.<br />
If there had not been a hard layer of rock beneath the soil,<br />
&#xa0;they would have completed the job in a few hours.<br />
As it is, they have been drilling for sixteen hours<br />
&#xa0;and they still have a long way to go.<br />
Meanwhile, a microphone, which was lowered into the mine two hours ago,<br />
&#xa0;has enabled the men to keep in touch with their closest relatives.<br />
Though they are running out of food and drink,<br />
&#xa0;the men are cheerful and confident that they will get out soon.<br />
They have been told<br />
&#xa0;that rescue operations are progressing smoothly.<br />
If they knew how difficult it was to drill through the hard rock,<br />
&#xa0;they would lose heart.<br />
</p>
</div>

<div id="outline-container-org5a3c98f" class="outline-3">
<h3 id="org5a3c98f">words</h3>
<div class="outline-text-3" id="text-org5a3c98f">
<p>
trap [træp] v.陷入,使陷入困境<br />
surface [ˈsɜrfəs] n.地面,表面<br />
explosive [ɪkˈsploʊsɪv] n.炸药<br />
vibration [vaɪˈbreɪʃ(ə)n] n.震动<br />
collapse [kəˈlæps] v.坍塌<br />
drill [drɪl] v.钻孔<br />
capsule [ˈkæpˌsjul] n.容器<br />
layer [ˈleɪr] n.层<br />
beneath [bɪˈniθ] prep.在&#x2026;之下<br />
lower [ˈloʊr] v.放下,降低<br />
progress [prəˈɡres] v.进展,进行<br />
smoothly [ˈsmuːðli] adv.顺利地<br />
</p>
</div>
</div>
<div id="outline-container-orgd245f27" class="outline-3">
<h3 id="orgd245f27">单词造句</h3>
</div>
<div id="outline-container-org14a72a9" class="outline-3">
<h3 id="org14a72a9">反复听电影片段</h3>
</div>
<div id="outline-container-org3902a80" class="outline-3">
<h3 id="org3902a80">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-org3a8f6ad" class="outline-3">
<h3 id="org3a8f6ad">给自己讲解</h3>
</div>
<div id="outline-container-orgf127e3e" class="outline-3">
<h3 id="orgf127e3e">红皮书</h3>
</div>
<div id="outline-container-orgdf7cceb" class="outline-3">
<h3 id="orgdf7cceb">习惯用法造句</h3>
</div>
<div id="outline-container-orgf30e760" class="outline-3">
<h3 id="orgf30e760">跟读至背诵</h3>
</div>
<div id="outline-container-org0b14469" class="outline-3">
<h3 id="org0b14469">Ask me if 写+读</h3>
</div>
<div id="outline-container-orgca5ade0" class="outline-3">
<h3 id="orgca5ade0">摘要写作</h3>
</div>
<div id="outline-container-orgbb71691" class="outline-3">
<h3 id="orgbb71691">tell the story 口语</h3>
</div>
<div id="outline-container-org85ea512" class="outline-3">
<h3 id="org85ea512">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
